###########################################################################################################################################################################################
#1.4.	Расшарить папку на компьютере
###########################################################################################################################################################################################

#Get-WmiObject -List | where{$_ -like "*share*"}


#Shares list 
Get-WmiObject win32_share


# create pointer to class
$comp=[WMICLASS]"Win32_share"
try {
    # create a new share
    $comp.create("c:\temp","mynewshare",0) 
}
catch {
  Write-Output "I cant' create share"
}


# see results
gwmi win32_share 

